package com.epam.automation.classes.maintask;

//Задание. Создать консольное приложение, удовлетворяющее следующим требованиям:
//
//        Каждый класс должен иметь отражающее смысл название и информативный состав.
//        Использовать возможности ООП: классы, наследование, полиморфизм, инкапсуляция.
//        Наследование должно применяться только тогда, когда это имеет смысл.
//        При кодировании должны быть использованы соглашения об оформлении кода java code convention.
//        Классы должны быть грамотно разложены по пакетам
//        Консольное меню должно быть минимальным.
//        Для хранения параметров инициализации можно использовать файлы.
//
//        Варианты:
//
//        1. Цветочница. Определить иерархию цветов. Создать несколько объектов-цветов. Собрать букет
//        (используя аксессуары) с определением его стоимости. Провести сортировку цветов в букете на
//        основе уровня свежести. Найти цветок в букете, соответствующий заданному диапазону длин стеблей.


public class Task {
}
